Операнды арифметического выражения записаны в системе счисления с основанием 14.

`14𝑦5𝑥214+31𝑥2𝑦3

В записи чисел переменными `𝑥,𝑦` обозначены неизвестные цифры из алфавита 14-ричной системы счисления.

Определите такие значения переменных `𝑥` и `𝑦`, при которых значение данного арифметического выражения кратно 9, а их сумма максимальна. Если таких вариантов окажется несколько, выберите вариант с наибольшим значением переменной `𝑥`.

Для найденных значений `𝑥` и `𝑦` вычислите частное от деления значения арифметического выражения на 9 и укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.

``` Python
for x in "1234567890ABCD":  
    for y in "124567890ABCD":  
        n1 = "14" + y + "5" + x + "2"  
        n2 = "31" + x + "2" + y + "3"  
        n1 = int(n1, 14)  
        n2 = int(n2, 14)  
        if (n1 + n2) % 9 == 0:  
            print((n1 + n2) / 9, n1)
```
Ответ: 266657